In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [4]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [5]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [8]:
ser3.reindex(range(15), method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [9]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])

In [10]:
dframe

       col1      col2      col3      col4      col5
A -0.112662 -1.482360 -0.388626  0.087459  1.135211
B  0.824280  1.434879  0.735743 -0.055481  0.443864
D  0.823267 -1.349643  0.526587 -1.289458  0.280613
E  0.962928 -1.392088 -0.915561  1.406952 -0.630383
F -1.266258 -0.175602 -0.944010 -0.956898  0.420453

In [11]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [12]:
dframe2

       col1      col2      col3      col4      col5
A -0.112662 -1.482360 -0.388626  0.087459  1.135211
B  0.824280  1.434879  0.735743 -0.055481  0.443864
C       NaN       NaN       NaN       NaN       NaN
D  0.823267 -1.349643  0.526587 -1.289458  0.280613
E  0.962928 -1.392088 -0.915561  1.406952 -0.630383
F -1.266258 -0.175602 -0.944010 -0.956898  0.420453

In [13]:
new_columns = ['col1','col2','col3','col4','col5','col6']

dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.112662 -1.482360 -0.388626  0.087459  1.135211   NaN
B  0.824280  1.434879  0.735743 -0.055481  0.443864   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.823267 -1.349643  0.526587 -1.289458  0.280613   NaN
E  0.962928 -1.392088 -0.915561  1.406952 -0.630383   NaN
F -1.266258 -0.175602 -0.944010 -0.956898  0.420453   NaN

In [15]:
dframe

       col1      col2      col3      col4      col5
A -0.112662 -1.482360 -0.388626  0.087459  1.135211
B  0.824280  1.434879  0.735743 -0.055481  0.443864
D  0.823267 -1.349643  0.526587 -1.289458  0.280613
E  0.962928 -1.392088 -0.915561  1.406952 -0.630383
F -1.266258 -0.175602 -0.944010 -0.956898  0.420453